using UnityEngine;

/*  
 *  [학습 제목]
 *  인터페이스와 조작법 살펴보기 
 *  
 *  [학습 일자]
 *  파일 생성 일자 : 26.01.04 오후 12:54
 *  마지막 수정 일자 : 26.01.04 오후 13:33
 *  
 *  [학습 내용]
 *  1. 기본 인터페이스는 4개 창으로 구성
 *    1-1. 프로젝트 (Project)
 *         게임을 구성하는 파일 들이 포함됨 (스크립트, 에셋, 그래픽 등)
 *    1-2. 계층구조 (Hierachy)
 *         게임 오브젝트를 확인을 하거나 직접 만들 수 있음
 *    1-3. 장면 (Scene)
 *         계층 구조에서 생성한 게임 오브젝트들은 해당 장면에서 볼 수 있음
 *    1-4. 인스펙터 (Inspector)
 *         게임 오브젝트의 속성들을 확인할 수 있음
 *        
 *   2. 게임 오브젝트 생성
 *     1-1. 계층 구조에서 마우스 오른쪽 클릭으로 생성할 수 있음
 *     1-2. 윗 창 게임 오브젝트에서 선택하여 생성할 수 있음
 *        
 *   3. 조작법
 *     1-1. 뷰이동 [Q]
 *          드래그로 화면을 원하는 곳으로 움직일 수 있음
 *     1-2. 이동 [W]
 *          오브젝트의 XYZ 기즈모가 나타나고, 화살표를 눌러 그 쪽 방향으로 이동이 가능
 *     1-3. 회전 [E]
 *          오브젝트의 360도 기즈모가 나타나고, 선 방향을 눌러 회전이 가능
 *          또는, 회색을 눌러 자유롭게 회전이 가능
 *     1-4. 크기 [R]
 *          오브젝트의 XYZ 기즈모가 나타나고, 화살표를 눌러 그 쪽 방향으로 크기 조절이 가능
 *          가운데로 늘리면 비율을 유지한 채 크기를 늘리거나 줄일 수 있음
 *     1-5. 사각툴 [T]
 *          3D 모델링 보다는 2D 혹은 UI에 자주 쓰임
 *     1-6. 카메라 회전 [마우스 오른쪽 버튼]
 *     1-7. 카메라 축 이동 [Alt + 마우스 왼쪽 버튼]
 *          보고 있는 화면을 기준으로 화면이 이동
 *     1-8. 카메라 확대 축소 [Alt + 마우스 오른쪽 클릭]
 *          보고 있는 화면을 기준으로 화면이 확대되고 축소됨
 *          위 방향으로 마우스 움직임 → 축소
 *          아래 방향으로 마우스 움직임 → 확대
 *     1-9. 화면 자유 이동 [방향키 ↑, ↓, ←, →]
 *          누른 방향으로 화면이 움직임
 *     1-10. 카메라 이동 줌 [마우스 휠 버튼]
 *          휠 버튼 꾹 → 이후 움직이는 방향으로 화면 이동
 *          휠 위로 → 화면 확대
 *          휠 아래로 → 화면 축소
 */

public class Interface_and_Manual_Note : MonoBehaviour
{
    
}
